-- ИТОГОВАЯ РАБОТА.
-- Создаём базу данных, таблицы (с их заполнением).

Use Bus_stop
Go

-- Если таблица(-ы) уже существует(-ют), то удаляем её(их).
If( OBJECT_ID('Bus_stop.Города',   'U')	is Not NULL)
	Drop Table Города;
If( OBJECT_ID('Bus_stop.Водители', 'U')	is Not NULL)
	Drop Table Водители;
If( OBJECT_ID('Bus_stop.Автобусы', 'U')	is Not NULL)
	Drop Table Автобусы;
If( OBJECT_ID('Bus_stop.Маршруты', 'U')	is Not NULL)
	Drop Table Маршруты;
If( OBJECT_ID('Bus_stop.Поездки',  'U')	is Not NULL)
	Drop Table Поездки;
If( OBJECT_ID('Bus_stop.Кассы',	   'U')	is Not NULL)
	Drop Table Кассы;
If( OBJECT_ID('Bus_stop.Клиенты',  'U')	is Not NULL)
	Drop Table Клиенты;
If( OBJECT_ID('Bus_stop.Билеты',   'U')	is Not NULL)
	Drop Table Билеты;

Use master;
Go

-- Если База данных не существует, то создаём её, а если существует - удаляем её
IF DB_ID('Bus_stop') is not NULL
	Drop Database Bus_stop;
If DB_ID('Bus_stop') is NULL
	Create Database Bus_stop;

Go
Use Bus_stop;

-------------------------------------------------------------------------------------------------
-- Создаём таблицу с городами и заполняем её.
Create Table Города(
	ID Int primary key Identity(1,1) not null,
	Название Varchar(40)			 not null
);

Insert Into Города
	Values('Москва'),
		  ('Красноярск'),
		  ('Новосибирск'),
		  ('Владивосток'),
		  ('Томск'),
		  ('Казань'),
		  ('Сочи'),
		  ('Чита'),
		  ('Челябинск'),
		  ('Железногорск');

-------------------------------------------------------------------------------------------------
-- Создаём таблицу с водителями и заполняем её.
Create Table Водители(
	ID Int primary key Identity(1,1)		   		  not null,
	Имя Varchar(30)									  not null,
	[ID Города] Int	FOREIGN KEY REFERENCES Города(ID) not null
);

Insert Into Водители
	Values('Алексей А',	  1),
		  ('Димочка Б',   1),
		  ('Вадим В',	  2),
		  ('Кирилл Г',    2),
		  ('Николай Д',   3),
		  ('Виктор Е',	  3),
		  ('Александр И', 4),
		  ('Софья',		  4),
		  ('Никита Й',	  5),
		  ('Екатерина',   5),
		  ('Владимир Ё',  6),
		  ('Арсений К',   6),
		  ('Роман Л',     7),
		  ('Матвей М',    7),
		  ('Ангелина Н',  8),
		  ('Валерия П',   8),
		  ('Алиса Р',     9),
		  ('Марианна С',  9),
		  ('Мадина Т',   10),
		  ('Милана Ф',   10);

-------------------------------------------------------------------------------------------------
-- Создаём таблицу с автобусами и заполняем её.
Create Table Автобусы(
	ID Int primary key Identity(1,1) not null,
	[Марка] Varchar(20)				 not null,
	[Количество Мест] Int			 not null,
	[Гос. номер] Varchar(10)		 not null
);

Insert Into Автобусы
	Values('шКольнЫй', 40, 'Х194НМ'),
		  ('шКольнЫй', 40, 'Р111НК'),
		  ('шКольнЫй', 40, 'Н003ММ'),
		  ('шКольнЫй', 40, 'Ы003ММ'),
		  ('Volvo',	   30, 'С777НР'),
		  ('Volvo',    30, 'В224ЕВ'),
		  ('Volvo',    30, 'У900ТА'),
		  ('Мерседес', 25, 'А093КА'),
		  ('Мерседес', 25, 'В123ЙЫ'),
		  ('Мерседес', 25, 'Н412ГИ');
		  
-------------------------------------------------------------------------------------------------
-- Создаём таблицу с маршрутами и заполняем её.
Create Table Маршруты(
	ID Int primary key Identity(1,1)				    not null,
	[День Недели] INT								    not null, --цифрой или буквой о_о
	[Время отбытия]  time(0)						    not null,
	[Время прибытия] time(0)						    not null,
	[ID_Города A] Int FOREIGN KEY REFERENCES Города(ID) not null,
	[ID_Города B] Int FOREIGN KEY REFERENCES Города(ID) not null,
	Стоимость Int									    not null,
	[Мин_Кол-во мест] Int							    not null
);

Insert Into Маршруты
	Values(1, '10:00:00', '23:30:00', 1,  4, 3250, 25),
	      (1, '11:25:00', '16:00:00', 2,  4, 1900, 15),
		  (2, '09:45:00', '19:15:00', 3,  6, 2150, 20),
		  (3, '08:35:00', '13:40:00', 5,  8, 1100, 10),
		  (3, '12:00:00', '19:30:00', 9, 10, 2450, 20),
		  (3, '16:00:00', '22:10:00', 3,  5, 1150, 15),
		  (4, '13:45:00', '17:30:00', 1,  6, 850,  25),
		  (5, '07:30:00', '14:25:00', 6,  3, 1500, 25),
		  (6, '09:55:00', '16:55:00', 5, 10, 1400, 25),
		  (7, '10:10:00', '21:25:00', 6,  3, 2350, 20);	

-------------------------------------------------------------------------------------------------
-- Создаём таблицу с поездками( типо "Trip" ) и заполняем её.
Create Table Поездки(
	ID Int primary key Identity(1,1)					  not null,
	[ID Маршрута] INT FOREIGN KEY REFERENCES Маршруты(ID) not null,
	[ID Автобуса] INT FOREIGN KEY REFERENCES Автобусы(ID) not null,
	[ID Водителя] INT FOREIGN KEY REFERENCES Водители(ID) not null,
	[Дата прибытия] Date					  			  not null
);

Insert Into Поездки
	Values(1, 10,  2, '21-03-25'),
		  (2,  1,  3, '21-04-20'),
		  (3,  2,  5, '21-05-28'),
		  (4,  6,  9, '21-06-07'),
		  (5,  5, 17, '21-06-18');

-------------------------------------------------------------------------------------------------
-- Создаём таблицу с кассами и заполняем её.
Create Table Кассы(
	ID Int primary key Identity(1,1)				  not null,
	[ID Города] INT FOREIGN KEY REFERENCES Города(ID) not null,
	Адрес Varchar (90)						  		  not null
);

Insert Into Кассы
	Values(1, '2-й Вышеславцев пер., Москва, 127018'),
		  (1, 'Электролитный пр-д, Москва, 115230'),
		  (2, 'Комсомольский пр., 1Б, Красноярск, Красноярский край, 660118'),
		  (3, 'Бухарестская ул., 24, Санкт-Петербург, 192102'),
		  (4, 'ул. Камская, 5б, Владивосток, Приморский край, 690062'),
		  (4, 'пр. Красного Знамени, 121, Владивосток, Приморский край, 690014'),
		  (5, 'Сибирская ул., 108, Томск, Томская обл., 634021'),
		  (5, 'ул. Трудовая, 22, Томск, Томская обл., 634024'),
		  (6, 'просп. Универсиады, 1, Казань, Респ. Татарстан, 420059'),
		  (6, 'ул. Восстания, 110, Казань, Респ. Татарстан, 420095'),
		  (7, 'Сочи, Краснодарский край, 354057'),
		  (8, 'Набережная ул., 72, Чита, Забайкальский край, 672014'),
		  (9, 'ул. Кузнецова, 1, офис 208, Челябинск, Челябинская обл., 454087'),
		  (9, 'Свердловский тракт, Челябинск, Челябинская обл., 454052'),
		  (10, 'ул. Ленина, 7, Железногорск, Красноярский край, 662971');

-------------------------------------------------------------------------------------------------
-- Создаём таблицу с клиентами и заполняем её.
Create Table Клиенты(
	ID Int primary key Identity(1,1) not null,
	Имя Varchar(20)					 not null,
	Информация Varchar(60)			 not null
);

Insert Into Клиенты
	Values('Николай',	'Человек'),
		  ('Алексей',	'Тоже человек'),
		  ('Никита',	'Опять человек'),
		  ('Алина',		'Снова человек'),
		  ('Владислав', 'Очередной человек'),
		  ('Валерия',	'Хьюмэн'),
		  ('Роман',		'Всё ещё человек'),
		  ('Платон',    'Imposter!? O_o'),
		  ('Глеб',		'У меня кончилась фантазия :('),
		  ('Кира',		'У меня кончилась фантазия :('),
		  ('Анастасия', 'У меня кончилась фантазия :('),
		  ('Артём',		'У меня кончилась фантазия :('),
		  ('Таисия',	'У меня кончилась фантазия :('),
		  ('Андрей',	'У меня кончилась фантазия :('),
		  ('Макар',		'У меня кончилась фантазия :('),
		  ('Виктория',  'У меня кончилась фантазия :('),
		  ('Ксения',	'У меня кончилась фантазия :('),
		  ('Демьян',	'У меня кончилась фантазия :('),
		  ('Амогус',	'У меня кончилась фантазия :(');

-------------------------------------------------------------------------------------------------
-- Создаём таблицу с билетами и заполняем её.
Create Table Билеты(
	ID Int primary key Identity(1,1)					 not null,
	[ID Кассы] INT FOREIGN KEY REFERENCES Кассы(ID)		 not null,
	[ID Поездки] INT FOREIGN KEY REFERENCES	Поездки(ID)	 not null,
	Место INT											 not null,
	[Дата покупки] Date									 not null,
	[ID Клиента] Int FOREIGN KEY REFERENCES Клиенты(ID)  not null
);

Insert Into Билеты
	Values(1, 1, 24, '21-03-15', 1),
		  (1, 1, 24, '21-03-17', 3),
		  (1, 1, 31, '21-03-16', 2),
		  (1, 1, 24, '21-03-17', 3),
		  (1, 2,  6, '21-04-11', 4),
		  (2, 2, 24, '21-04-12', 5),
		  (3, 2, 34, '21-04-13', 6),
		  (3, 3, 11, '21-05-22', 7),
		  (4, 3, 34, '21-05-23', 8),
		  (5, 3, 27, '21-05-24', 9),
		  (6, 4, 10, '21-06-01', 10),
		  (6, 4, 33, '21-06-02', 11),
		  (7, 4, 11, '21-06-03', 12),
		  (7, 5,  7, '21-06-12', 13),
		  (8, 5, 25, '21-06-13', 14),
		  (10,5, 18, '21-06-14', 15);